EDT/ZUP/zup_edt/src/Documents/ФактПоказателяЭффективностиПодразделений/ФактПоказателяЭффективностиПодразделений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ФактПоказателяЭффективностиПодразделений</name>
  <registerRecords>AccumulationRegister.ФактическиеЗначенияПоказателейЭффективностиПодразделений</registerRecords>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Горизонт</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.СтруктураЦелей</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Подразделения</name>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>DefinedType.ЗначениеПоказателяЭффективности</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/ZUP/zup_edt/src/AccumulationRegisters/ФактическиеЗначенияПоказателейЭффективностиПодразделений/ФактическиеЗначенияПоказателейЭффективностиПодразделений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ФактическиеЗначенияПоказателейЭффективностиПодразделений</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Значение</name>
    <type>
      <types>DefinedType.ЗначениеПоказателяЭффективности</types>
    </type>
  </resources>
  <dimensions>
    <name>Горизонт</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.СтруктураЦелей</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

EDT/ZUP/zup_edt/src/Documents/ФактПоказателяЭффективностиПодразделений/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступом.ЗаполнитьНаборыЗначенийДоступа.
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	МассивПодразделений = Подразделения.ВыгрузитьКолонку("Подразделение");
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицуИзМассива(Таблица, МассивПодразделений, "ЗначениеДоступа");
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	ДанныеДляПроведения = Документы.ФактПоказателяЭффективностиПодразделений.ПолучитьДанныеДляПроведения(Ссылка);
	КлючевыеПоказателиЭффективности.СформироватьДвиженияФактическиеЗначенияПоказателейЭффективностиПодразделений(Движения, ДанныеДляПроведения.ФактПодразделений);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ЭтоСуммируемыйПоказатель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Показатель, "Суммируемый");
	Если ЭтоСуммируемыйПоказатель = Истина Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаФактаПодразделений = РегистрыНакопления.ФактическиеЗначенияПоказателейЭффективностиПодразделений.ТаблицаИзмеренийПланаПодразделений();
	
	Для каждого СтрокаПодразделений Из Подразделения Цикл
		НоваяСтрока = ТаблицаФактаПодразделений.Добавить();
		НоваяСтрока.ДатаНачала = НачалоМесяца(Период);
		НоваяСтрока.ДатаОкончания = КонецМесяца(Период);
		НоваяСтрока.Горизонт = Горизонт;
		НоваяСтрока.Подразделение = СтрокаПодразделений.Подразделение;
		НоваяСтрока.Показатель = Показатель;
	КонецЦикла; 
	
	ТаблицаВведенныхЗначений = КлючевыеПоказателиЭффективности.ВведенныеФактическиеЗначенияПоказателейПодразделений(ТаблицаФактаПодразделений, Ссылка);
	
	Для каждого СтрокаВведенныхЗначений Из ТаблицаВведенныхЗначений Цикл
		НайденныеСтроки = Подразделения.НайтиСтроки(Новый Структура("Подразделение", СтрокаВведенныхЗначений.Подразделение));
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Для подразделения %1 уже введено фактическое значение показателя %2.'"), СтрокаВведенныхЗначений.Подразделение, Показатель);
		Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			ОбщегоНазначения.СообщитьПользователю(
				ТекстОшибки,
				ЭтотОбъект,
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Подразделения[%1].Подразделение", Подразделения.Индекс(НайденнаяСтрока)),, Отказ);
		КонецЦикла; 
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
